In [26]:
import pandas as pd

df_01 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '01')
df_02 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '02')
df_03 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '03')
df_04 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '04')
df_05 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '05')
df_06 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '06')
df_08 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '08')
df_09 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '09')
df_10 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '10')
df_11 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '7B')
df_12 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '7C')
df_13 = pd.read_excel('텍사스주_우물정보_25_02.xls', sheet_name= '8A')

# Combine all the dataframes into one
df = pd.concat([df_01, df_02, df_03, df_04, df_05, df_06, df_08, df_09, df_10, df_11, df_12, df_13], ignore_index=True)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1239 entries, 0 to 1238
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   District               1239 non-null   object
 1   API Number             1239 non-null   int64
 2   Field Name             1198 non-null   object
 3   Field Number           1198 non-null   float64
 4   Lease/Gas ID           1235 non-null   float64
 5   Lease Name             1239 non-null   object
 6   Well Number            1200 non-null   object
 7   Operator Name          1239 non-null   object
 8   County Name            1239 non-null   object
 9   County Number          1239 non-null   int64
 10  Survey Name            1239 non-null   object
 11  Survey Section Number  956 non-null    float64
 12  Alternate Survey Name  0 non-null      float64
 13  Abstract Number        1190 non-null   object
 14  Block                  782 non-null    object
 15  O/G/D code             1239 non-null   object
 16  Top Log Interval       1239 non-null   int64
 17  Bottom Total Depth     1239 non-null   int64
 18  Document Date          1239 non-null   object
 19  Image Size             1239 non-null   object
 20  Scan Date              1239 non-null   object
 21  Log Description        1239 non-null   object
 22  Image path             1239 non-null   object
dtypes: float64(4), int64(4), object(15)
memory usage: 222.8+ KB

In [ ]:
# 데이터 열 고르기
selected_columns = df[['API Number', 'County Name', 'County Number', 'Bottom Total Depth']]
selected_columns.head()

   API Number County Name  County Number  Bottom Total Depth
0     1335890    ATASCOSA             13               17409
1    47944500        WEBB            479               20012
2    47944499        WEBB            479               19340
3    12738440      DIMMIT            127               17485
4    12738426      DIMMIT            127               15622

In [27]:
# county 값 갯수 카운트
selected_columns['County Name'].value_counts()

County Name
MIDLAND       88
REEVES        82
MARTIN        79
HOWARD        78
COCHRAN       65
              ..
PALO PINTO     1
DENTON         1
COTTLE         1
FOARD          1
CROSBY         1
Name: count, Length: 95, dtype: int64

In [29]:
# county 기준으로 내림차순 정렬
sorted_selected_columns = selected_columns.sort_values(by=['County Name', 'Bottom Total Depth'], ascending=[True, False])
sorted_selected_columns.head()

     API Number County Name  County Number  Bottom Total Depth
193      132842    ANDERSON              1               12064
194      132842    ANDERSON              1               12064
191      132854    ANDERSON              1                9342
192      132854    ANDERSON              1                9342
734      348418     ANDREWS              3               20419

In [ ]:
# county 마다 평균 깊이
county_avg_depth = sorted_selected_columns.groupby('County Name')['Bottom Total Depth'].mean()
county_avg_depth

County Name
ANDERSON    10703.000000
ANDREWS     11747.500000
ARCHER       4506.333333
ATASCOSA    17589.714286
BEE         23334.000000
                ...
WINKLER      9490.846154
WISE        14551.125000
YOAKUM       8151.222222
YOUNG        2731.538462
ZAVALA       1855.000000
Name: Bottom Total Depth, Length: 95, dtype: float64

In [ ]:
# county 별 갯수와 평균 깊이를 계산(최종 데이터 프레임)
county_stats = sorted_selected_columns.groupby(['County Name', 'County Number']).agg(
    County_Count=('County Name', 'size'),
    County_Avg_Depth=('Bottom Total Depth', 'mean')
).reset_index()

county_stats

   County Name  County Number  County_Count  County_Avg_Depth
0     ANDERSON              1             4      10703.000000
1      ANDREWS              3            16      11747.500000
2       ARCHER              9            18       4506.333333
3     ATASCOSA             13            14      17589.714286
4          BEE             25             2      23334.000000
..         ...            ...           ...               ...
90     WINKLER            495            13       9490.846154
91        WISE            497             8      14551.125000
92      YOAKUM            501             9       8151.222222
93       YOUNG            503            13       2731.538462
94      ZAVALA            507             2       1855.000000

[95 rows x 4 columns]